## <span style="color:#2F749F;"><strong>Ejercicio 1. Limpieza e imputaci칩n de un conjunto de datos mixto</strong></span>

#### <span style="color:#2F749F;"><strong>游늶 Instrucciones</strong></span>

1. Crea el DataFrame base **df** ejecutando el siguiente c칩digo:
    ```python
    df = pd.DataFrame({
        'Nombre': ['Ana', 'Luis', 'Pedro', None, 'Marta', 'Luis', 'Sof칤a'],
        'Edad': [25, np.nan, 35, 29, -5, 25, None],
        'Ciudad': ['Bogot치', 'Medell칤n', None, 'Medell칤n', 'Cali', 'Bogot치', 'Cali'],
        'Ingreso': [3500, 4800, np.nan, 5200, 5100, np.nan, 4700],
        'FechaIngreso': ['2023-01-01', '2023-01-05', None, '2023-01-10', '2023-01-12', None, '2023-01-15']
    })

2. En un nuevo notebook, aplica las etapas del proceso de limpieza e imputaci칩n de datos que consideres necesarias sobre el DataFrame df. Ten encuenta incluir:
    - C칩digo correctamente comentado y ejecutado.
    - Explicaciones breves de cada paso.
    - Resultados visuales o estad칤sticos que evidencien las transformaciones.

In [2]:
# Hacemos todos los imports necesarios
import os
import sys
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [15]:
df = pd.DataFrame({
        'Nombre': ['Ana', 'Luis', 'Pedro', None, 'Marta', 'Luis', 'Sof칤a'],
        'Edad': [25, np.nan, 35, 29, -5, 25, None],
        'Ciudad': ['Bogot치', 'Medell칤n', None, 'Medell칤n', 'Cali', 'Bogot치', 'Cali'],
        'Ingreso': [3500, 4800, np.nan, 5200, 5100, np.nan, 4700],
        'FechaIngreso': ['2023-01-01', '2023-01-05', None, '2023-01-10', '2023-01-12', None, '2023-01-15']
    })
df

  Nombre  Edad    Ciudad  Ingreso FechaIngreso
0    Ana  25.0    Bogot치   3500.0   2023-01-01
1   Luis   NaN  Medell칤n   4800.0   2023-01-05
2  Pedro  35.0      None      NaN         None
3   None  29.0  Medell칤n   5200.0   2023-01-10
4  Marta  -5.0      Cali   5100.0   2023-01-12
5   Luis  25.0    Bogot치      NaN         None
6  Sof칤a   NaN      Cali   4700.0   2023-01-15

In [16]:
#A los valores nulos los cambiamos por nulos tipo NaN pero para el formato de fechas
df['FechaIngreso'] = pd.to_datetime(df['FechaIngreso'], errors='coerce')

# Formatear en dd-mm-YYYY (como string para visualizarlo, pero sigue siendo datetime internamente)
df['FechaIngreso'] = df['FechaIngreso'].dt.strftime('%d-%m-%Y')

#A la columna "FeechaIngreso" los valores nulos los reemplazamos por el valor anterior o siguiente
df['FechaIngreso'] = df['FechaIngreso'].ffill().bfill()
df

  Nombre  Edad    Ciudad  Ingreso FechaIngreso
0    Ana  25.0    Bogot치   3500.0   01-01-2023
1   Luis   NaN  Medell칤n   4800.0   05-01-2023
2  Pedro  35.0      None      NaN   05-01-2023
3   None  29.0  Medell칤n   5200.0   10-01-2023
4  Marta  -5.0      Cali   5100.0   12-01-2023
5   Luis  25.0    Bogot치      NaN   12-01-2023
6  Sof칤a   NaN      Cali   4700.0   15-01-2023

In [17]:
#A la columna "Ingreso" los valores nulos los reemplazamos por la media de la columna
df['Ingreso'].fillna(df['Ingreso'].mean(), inplace=True)

C:\Users\User\AppData\Local\Temp\ipykernel_112612\2000759280.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Ingreso'].fillna(df['Ingreso'].mean(), inplace=True)

In [18]:
# Hacemis imputacion de valores negativos y nulos en la columna "Edad" con la mediana
df['Edad'] = df['Edad'].apply(lambda x: df['Edad'].median() if (pd.isnull(x) or x < 0) else x)

In [20]:
# A la columna "Ciudad" los valores nulos los reemplazamos por el valor anterior o siguiente
df['Ciudad'] = df['Ciudad'].ffill().bfill()
df

  Nombre  Edad    Ciudad  Ingreso FechaIngreso
0    Ana  25.0    Bogot치   3500.0   01-01-2023
1   Luis  25.0  Medell칤n   4800.0   05-01-2023
2  Pedro  35.0  Medell칤n   4660.0   05-01-2023
3   None  29.0  Medell칤n   5200.0   10-01-2023
4  Marta  25.0      Cali   5100.0   12-01-2023
5   Luis  25.0    Bogot치   4660.0   12-01-2023
6  Sof칤a  25.0      Cali   4700.0   15-01-2023

*Nota:*  Para la columna de nombbres que tengan valores nulos, los dejaremos intectos porque  no nos podemos sacar sus nombres de debajo de la manga, tampoco sabemos a quien pertenecen, y no hay mas considencias como en edades que nos permitan imputarlo, entonces dejaremos la variable intacta

## <span style="color:#2F749F;"><strong>Ejercicio 2. Limpieza de duplicados</strong></span>

#### <span style="color:#2F749F;"><strong>游늶 Instrucciones</strong></span>

1. Crea el DataFrame base **df** ejecutando el siguiente c칩digo:
    ```python
    df = pd.DataFrame({
        'ID': [101, 102, 102, 103, 104, 104, 104],
        'Nombre': ['Ana', 'Luis', 'Luis', 'Marta', 'Carlos', 'Carlos', 'Carlos'],
        'Edad': [25, 30, 30, 29, 40, 40, 41],
        'Ciudad': ['Bogot치', 'Cali', 'Cali', 'Medell칤n', 'Cali', 'Cali', 'Cali'],
        'FechaRegistro': ['2023-01-01', '2023-01-05', '2023-01-05', '2023-01-10', 
                        '2023-01-15', '2023-01-15', '2023-01-16']
    })

2.  En el mismo notebook anterior, para el nuevo dataframe df, responde a las siguientes preguntas (utilizando python):
    - 쮺u치l es el total de registros originales?
    - 쮺u치les y cu치ntos son los duplicados exactos?
    - 쮺u치les y cu치ntos son los duplicados por varias columnas?
    - 쮺u치ntos registros debes eliminar?
    - 쮺u치ntos registros quedan despu칠s de la limpieza?

In [23]:
df_p2 = pd.DataFrame({
        'ID': [101, 102, 102, 103, 104, 104, 104],
        'Nombre': ['Ana', 'Luis', 'Luis', 'Marta', 'Carlos', 'Carlos', 'Carlos'],
        'Edad': [25, 30, 30, 29, 40, 40, 41],
        'Ciudad': ['Bogot치', 'Cali', 'Cali', 'Medell칤n', 'Cali', 'Cali', 'Cali'],
        'FechaRegistro': ['2023-01-01', '2023-01-05', '2023-01-05', '2023-01-10', 
                        '2023-01-15', '2023-01-15', '2023-01-16']
    })
df_p2

    ID  Nombre  Edad    Ciudad FechaRegistro
0  101     Ana    25    Bogot치    2023-01-01
1  102    Luis    30      Cali    2023-01-05
2  102    Luis    30      Cali    2023-01-05
3  103   Marta    29  Medell칤n    2023-01-10
4  104  Carlos    40      Cali    2023-01-15
5  104  Carlos    40      Cali    2023-01-15
6  104  Carlos    41      Cali    2023-01-16

In [24]:
df_p2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   ID             7 non-null      int64
 1   Nombre         7 non-null      object
 2   Edad           7 non-null      int64
 3   Ciudad         7 non-null      object
 4   FechaRegistro  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [25]:
# Para el data frame df_p2, contamos los duplicados y decimos cuales son
df_p2.duplicated().sum()
df_p2[df_p2.duplicated(keep=False)]

    ID  Nombre  Edad Ciudad FechaRegistro
1  102    Luis    30   Cali    2023-01-05
2  102    Luis    30   Cali    2023-01-05
4  104  Carlos    40   Cali    2023-01-15
5  104  Carlos    40   Cali    2023-01-15

In [30]:
# Ahora hacemos los duplicados por la columna ID
df_p2.duplicated(subset=['ID', 'Ciudad']).sum()
df_p2[df_p2.duplicated(subset=['ID'], keep=False)]

    ID  Nombre  Edad Ciudad FechaRegistro
1  102    Luis    30   Cali    2023-01-05
2  102    Luis    30   Cali    2023-01-05
4  104  Carlos    40   Cali    2023-01-15
5  104  Carlos    40   Cali    2023-01-15
6  104  Carlos    41   Cali    2023-01-16

In [29]:
# Visualizamos los datos duplicados por la columna Ciudad y FechaRegistro
df_p2.duplicated(subset=['Ciudad', 'FechaRegistro']).sum()
df_p2[df_p2.duplicated(subset=['Ciudad', 'FechaRegistro'], keep=False)]

    ID  Nombre  Edad Ciudad FechaRegistro
1  102    Luis    30   Cali    2023-01-05
2  102    Luis    30   Cali    2023-01-05
4  104  Carlos    40   Cali    2023-01-15
5  104  Carlos    40   Cali    2023-01-15

Se deberian aliminar los datos quee coinsidan tanto en nombre de ID como en fecha de ingreso, esto debido a que el ID es unico por paciente, no importa si cambia el nombre (en teoria) y la fecha de ingreso pues no aportaria informacion relevante al dataset

In [31]:
# Eliminamos los duplicados por ID y fecha de Ingreso, dejando solo la primera ocurrencia
df_p2_cleaned = df_p2.drop_duplicates(subset=['ID', 'FechaRegistro'], keep='first')
df_p2_cleaned

    ID  Nombre  Edad    Ciudad FechaRegistro
0  101     Ana    25    Bogot치    2023-01-01
1  102    Luis    30      Cali    2023-01-05
3  103   Marta    29  Medell칤n    2023-01-10
4  104  Carlos    40      Cali    2023-01-15
6  104  Carlos    41      Cali    2023-01-16

- R// Despues de la limpieza quedan solo 5 registros

## <span style="color:#2F749F;"><strong>Ejercicio 3. Correcci칩n de errores tipogr치ficos o de codificaci칩n</strong></span>

#### <span style="color:#2F749F;"><strong>游늶 Instrucciones</strong></span>

1. Crea el DataFrame base **df** ejecutando el siguiente c칩digo:
    ```python
    df = pd.DataFrame({
        'Ciudad': ['bogota', 'Bogot치', 'BOGOTA', 'bogot치', 'bogata', 'B칩gota', 'BogoTa', 'Cali', 'cal칤', 'medell칤n', 'medellin']
    })

2.  En el mismo notebook anterior, para el nuevo dataframe df, estandariza la variable ciudad utilizando python.

In [3]:
df_p3 = pd.DataFrame({
        'Ciudad': ['bogota', 'Bogot치', 'BOGOTA', 'bogot치', 'bogata', 'B칩gota', 'BogoTa', 'Cali', 'cal칤', 'medell칤n', 'medellin']
    })
df_p3

      Ciudad
0     bogota
1     Bogot치
2     BOGOTA
3     bogot치
4     bogata
5     B칩gota
6     BogoTa
7       Cali
8       cal칤
9   medell칤n
10  medellin

In [4]:
# Aplicamos la funcion lower para pasar todo a minusculas
df_p3['Ciudad'] = df_p3['Ciudad'].str.lower()
# Remplazamos tildes por letras sin tilde
df_p3['Ciudad'] = df_p3['Ciudad'].str.normalize('NFKD').str.encode('ascii', errors='ignore').str.decode('utf-8')
# Con la funcion get_closest_matches de la libreria fuzzywuzzy podemos agrupar los nombres similares, en nuestro caso las palabras similares a nuestra lista de ciudades ['bogota', 'cali', 'medellin'] seran remplezadas por estas



df_p3

      Ciudad
0     bogota
1     bogota
2     bogota
3     bogota
4     bogata
5     bogota
6     bogota
7       cali
8       cali
9   medellin
10  medellin

In [5]:
from difflib import get_close_matches

# Lista base de nombres v치lidos en min칰sculas
ciudades_ref = ['bogota', 'medellin', 'cali']

# Funci칩n para reemplazar por la coincidencia m치s cercana
def corregir_ciudad(ciudad):
    match = get_close_matches(ciudad, ciudades_ref, n=1, cutoff=0.7)
    return match[0] if match else ciudad

# Aplicar correcci칩n
df_p3['Ciudad'] = df_p3['Ciudad'].apply(corregir_ciudad)

df_p3

      Ciudad
0     bogota
1     bogota
2     bogota
3     bogota
4     bogota
5     bogota
6     bogota
7       cali
8       cali
9   medellin
10  medellin